def area(a, b):
    '''
    Возвращает площадь прямоугольника.

        Параметры:
            a: сторона прямоугольника.
            b: сторона, перпендикулярная стороне 'a' прямоугольника.

        Возвращаемое значение:
            Площадь прямоугольника со сторонами 'a' и 'b'.
    '''
    return a * b

def perimeter(a, b):
    '''
    Возвращает периметр прямоугольника.

        Параметры:
            a: сторона прямоугольника.
            b: сторона, перпендикулярная стороне 'a' прямоугольника.

        Возвращаемое значение:
            Периметр прямоугольника со сторонами 'a' и 'b'.
    '''
    return 2 * (a + b)
